onepixel0/stm8-sdcc-cmake/StdPeriph/STM8L10x/Libraries/STM8L10x_StdPeriph_Driver/src/stm8l10x_flash.c
  /* Copy data bytes from RAM to FLASH memory */
  for (Count = 0; Count < FLASH_BLOCK_SIZE; Count++)
  {
    *((PointerAttr uint8_t*) (uint16_t)StartAddress + Count) = ((uint8_t)(Buffer[Count]));
  }
}

/**
  * @brief  Erases a block in the program or data memory.
  * @note   This function should be called and executed from RAM.
  * @param  BlockNum: Indicates the block number to erase
  * @param  FLASH_MemType:  The type of memory to erase
  *          This parameter can be one of the following values:
  *            @arg FLASH_MemType_Program: Program memory
  *            @arg FLASH_MemType_Data: Data EEPROM memory 
  * @retval None.
  */
IN_RAM(void FLASH_EraseBlock(uint8_t BlockNum))
{
  uint32_t PointerAttr *pwFlash;
  uint16_t StartAddress = 0;
  /* Check parameters */
  assert_param(IS_FLASH_BLOCK_NUMBER(BlockNum));

  StartAddress = FLASH_START_PHYSICAL_ADDRESS;
  /* Point to the first block address */
  pwFlash = (PointerAttr uint32_t *)(uint16_t)(StartAddress + ((uint16_t)BlockNum * (uint16_t)FLASH_BLOCK_SIZE));

  /* Enable Word Write Once */
  FLASH->CR2 |= FLASH_CR2_ERASE;

  *pwFlash = (uint32_t)0;
}
  
/**
  * @brief  Waits for a Flash operation to complete.
  * @note   The call and execution of this function must be done from RAM in case
  *         of Block operation, otherwise it can be executed from Flash
  * @param  FLASH_MemType : Memory type
  *          This parameter can be one of the following values:
  *            @arg FLASH_MemType_Program: Program memory
  *            @arg FLASH_MemType_Data: Data EEPROM memory 
  * @retval FLASH status
  */
IN_RAM(FLASH_Status_TypeDef FLASH_WaitForLastOperation(void))
{
  uint16_t timeout = OPERATION_TIMEOUT;
  uint8_t My_FlagStatus = 0x00;

  /* Wait until operation completion or write protected page occurred */
  while ((My_FlagStatus == 0x00) && (timeout != 0x00))
  {
    My_FlagStatus = (uint8_t)(FLASH->IAPSR & (uint8_t)(FLASH_IAPSR_EOP | FLASH_IAPSR_WR_PG_DIS));
    timeout--;
  }

  if (timeout == 0x00)
  {
    My_FlagStatus = (uint8_t)FLASH_Status_TimeOut;
  }

  return((FLASH_Status_TypeDef)My_FlagStatus);
}

#if defined (_COSMIC_) && defined (RAM_EXECUTION)
 /* End of FLASH_CODE section */
 #pragma section ()
#endif /* _COSMIC_ && RAM_EXECUTION */

/**
  * @}
  */
  
/**
  * @}
  */ 

/**
  * @}
  */
  
/**
  * @}
  */ 
  
/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/